app/controllers/signups_controller.rb

    def create
        @signup = Signup.new(signup_params)

        if @signup.save
---
INSERT INTO "signups" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "yo@gmail.com"], ["created_at", "2022-03-25 06:25:51.151366"], ["updated_at", "2022-03-25 06:25:51.151366"]]